---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.CalculationType
source: html/6f431420-8da3-21c6-4cc2-7c4a952eb938.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.CalculationType Property

The calculation type, a bitmask of FittingAndAccessoryCalculationType.

## Syntax (C#)
```csharp
public int CalculationType { get; }
```